using Code;
using System;
using System.Numerics;
using System.Text;

namespace MethodDissectionSeparation
{
    internal static class Encoding
    {
        public static void Main()
        {
            // Задаёте входные данные
            //var alf = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ_";

            var alf = new Dictionary<char, int[]>
                {
                    {'А', new int [] {123, 231, 321, 213}},
                    {'Б', new int [] {456, 564}},
                    {'В', new int [] {789, 897, 987}},
                    {'Г', new int [] {234, 342}},
                    {'Д', new int [] {876, 768}},
                    {'Е', new int [] {345, 453, 543, 435}},
                    {'Ё', new int [] {567, 675, 765}},
                    {'Ж', new int [] {976, 769}},
                    {'З', new int [] {134, 341}},
                    {'И', new int [] {965, 659, 569}},
                    {'Й', new int [] {145, 451}},
                    {'К', new int [] {954, 549, 459}},
                    {'Л', new int [] {156, 561, 651}},
                    {'М', new int [] {943, 439, 349}},
                    {'Н', new int [] {167, 671, 761, 617}},
                    {'О', new int [] {932, 329, 239, 392, 923, 293}},
                    {'П', new int [] {178, 781, 871}},
                    {'Р', new int [] {912, 129, 219}},
                    {'С', new int [] {189, 891, 981, 819}},
                    {'Т', new int [] {975, 759, 579, 795}},
                    {'У', new int [] {135, 351}},
                    {'Ф', new int [] {964}},
                    {'Х', new int [] {146, 461}},
                    {'Ц', new int [] {953}},
                    {'Ч', new int [] {157, 571}},
                    {'Ш', new int [] {942, 429}},
                    {'Щ', new int [] {168, 681}},
                    {'Ъ', new int [] {931}},
                    {'Ы', new int [] {179}},
                    {'Ь', new int [] {952}},
                    {'Э', new int [] {158, 581}},
                    {'Ю', new int [] {941, 419}},
                    {'Я', new int [] {169, 691, 961}},
                    {'_', new int [] {930, 309, 039, 390, 903, 093}}
                };

            var str = "БЕЗОПАСНОСТЬ_ГОСУДАРСТВА";
            var key = "243561";

            // Строка для вывода 
            var line = "";

            // namespace Encode в файле Encrypt
            line = Encode.ProportionEncryption(alf, str);
            Console.WriteLine(line);
        }

        // Для пропорциональьного шифра
        //var alf = new Dictionary<char, int[]>
        //    {
        //        {'А', new int [] {123, 231, 321, 213}},
        //        {'Б', new int [] {456, 564}},
        //        {'В', new int [] {789, 897, 987}},
        //        {'Г', new int [] {234, 342}},
        //        {'Д', new int [] {876, 768}},
        //        {'Е', new int [] {345, 453, 543, 435}},
        //        {'Ё', new int [] {567, 675, 765}},
        //        {'Ж', new int [] {976, 769}},
        //        {'З', new int [] {134, 341}},
        //        {'И', new int [] {965, 659, 569}},
        //        {'Й', new int [] {145, 451}},
        //        {'К', new int [] {954, 549, 459}},
        //        {'Л', new int [] {156, 561, 651}},
        //        {'М', new int [] {943, 439, 349}},
        //        {'Н', new int [] {167, 671, 761, 617}},
        //        {'О', new int [] {932, 329, 239, 392, 923, 293}},
        //        {'П', new int [] {178, 781, 871}},
        //        {'Р', new int [] {912, 129, 219}},
        //        {'С', new int [] {189, 891, 981, 819}},
        //        {'Т', new int [] {975, 759, 579, 795}},
        //        {'У', new int [] {135, 351}},
        //        {'Ф', new int [] {964}},
        //        {'Х', new int [] {146, 461}},
        //        {'Ц', new int [] {953}},
        //        {'Ч', new int [] {157, 571}},
        //        {'Ш', new int [] {942, 429}},
        //        {'Щ', new int [] {168, 681}},
        //        {'Ъ', new int [] {931}},
        //        {'Ы', new int [] {179}},
        //        {'Ь', new int [] {952}},
        //        {'Э', new int [] {158, 581}},
        //        {'Ю', new int [] {941, 419}},
        //        {'Я', new int [] {169, 691, 961}},
        //        {'_', new int [] {930, 309, 039, 390, 903, 093}}
        //    };
    }
}